talk_zittau/talk_zittau.org
:REVEAL_PROPERTIES:
#+REVEAL_THEME: moon
#+OPTIONS: timestamp:nil toc:1 num:nil
#+REVEAL_INIT_OPTIONS: slideNumber:true
#+REVEAL_EXTRA_SCRIPT_SRC: https://unpkg.com/@strudel/embed@latest https://unpkg.com/hydra-synth
:END:


#+TITLE: Quelloffene Musik - let's code a beat
#+AUTHOR: harte echtzeit
#+DATE: <2024-09-02 Mo>


* test hydra
#+REVEAL_HTML:<script> var hydra = new Hydra({ detectAudio: false }) osc(4, 0.1, 1.2).out() </script>
* Was ist live coding?
** allgemein
debugging als Kunstform...
- direkte Ausgabe von Musik, Visuals oder physischer Aktion (z.B. MIDI) als Ziel
- type >> interpret >> action
- Kulturtechnik, kein Genre
- radiakle Offenheit > keine Geheimnisse vor dem Publikum
*** Beispiel Musik
#+REVEAL_HTML:<iframe width="900" height="500" src="https://www.youtube.com/embed/ezSdPIKkp98?si=-Owr7uipGuBTJfHO" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>
*** Beispiel Visuals
#+REVEAL_HTML:<iframe width="900" height="500" src="https://www.youtube.com/embed/ql31mN1EXlw?si=uqJuFuyyYU75aFj8" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>
*** Beispiel Tanz
#+REVEAL_HTML:<iframe width="900" height="500" src="https://www.youtube.com/embed/hoV01_P6PGw?si=m192IJXerFtMoaDa" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>
** Algorave
- ein wesentliches Genre -> Techno mit Code
- ca. 10 Jahre alt
- TOPLAP-Manifesto ist hochgradig empowerment
  - "Obscurantism is dangerous. Show us your screens."
  - "Programs are instruments that can change themselves."
- [[https://tidalcycles.org/docs/around_tidal/toplap_manifesto/][link]] 
** Quelloffenheit auf allen Ebenen
- tools -> z.B. Tidal Cycles, Strudel, Hydra, P5Js, 
- code -> viele Performances auf github u.ä.
- Live Performance
- Austausch zwischen Künstler*innen (vor Ort und im Web)
* Musik machen
** Tidal Cycles
Eine Haskell-basierte Live-coding Sprache
#+BEGIN_SRC haskell
   d1 $ fast 1
  $ s "bd sd bd sd"
  # gain 0.9
  # room 0.4
#+END_SRC
- sehr kompakt und gut live zu spielen
- braucht Softwaresysnthesizer als Backend (typisch Supercollider)
- große Bibiliothek aus freien Samples und Synthesizern verfügbar
** Strudel
- JavaScript-Variante von TC
- läuft im Browser mit WebAudio als Backend
- gut für den Einstieg -> gute Visualisierungen und keine Installation
#+REVEAL_HTML:<iframe src="https://strudel.cc/#c291bmQoIltiZCBzZCBiZCBzZF0sIGhoKjgiKS5ldmVyeSgyLCB4PT54LnJvb20oIjAuNCIpKS5fcGlhbm9yb2xsKHtsYWJlbHM6MX0p" width="900" height="200"></iframe>
** Hydra
- Visuals live coding
- js-basiert, Schnittstellen zu OSC, MIDI, Audio vorhanden
#+REVEAL_HTML:<iframe src="https://hydra.ojack.xyz/?code=JTJGJTJGJTIwbGljZW5zZWQlMjB3aXRoJTIwQ0MlMjBCWS1OQy1TQSUyMDQuMCUyMGh0dHBzJTNBJTJGJTJGY3JlYXRpdmVjb21tb25zLm9yZyUyRmxpY2Vuc2VzJTJGYnktbmMtc2ElMkY0LjAlMkYlMEElMkYlMkYlMjB0cnlpbmclMjB0byUyMGdldCUyMGNsb3NlciUwQSUyRiUyRiUyMGJ5JTIwUml0Y2hzZSUwQSUyRiUyRiUyMGluc3RhZ3JhbS5jb20lMkZyaXRjaHNlJTBBb3NjKDYwJTJDJTIwLTAuMDE1JTJDJTIwMC4zKSUwQSUwOS5kaWZmKG9zYyg2MCUyQyUyMDAuMDgpJTBBJTA5JTA5LnJvdGF0ZShNYXRoLlBJJTIwJTJGJTIwMikpJTBBJTA5Lm1vZHVsYXRlU2NhbGUobm9pc2UoMy41JTJDJTIwMC4yNSklMEElMDklMDkubW9kdWxhdGVTY2FsZShvc2MoMTUpJTBBJTA5JTA5JTA5LnJvdGF0ZSgoKSUyMCUzRCUzRSUyME1hdGguc2luKHRpbWUlMjAlMkYlMjAyKSkpJTJDJTIwMC42KSUwQSUwOS5jb2xvcigxJTJDJTIwMC41JTJDJTIwMC43MDgpJTBBJTA5LmNvbnRyYXN0KDEuNCklMEElMDkuYWRkKHNyYyhvMCklMEElMDklMDkubW9kdWxhdGUobzAlMkMlMjAuMDQpJTJDJTIwLjYpJTBBJTA5LmludmVydCgpJTBBJTA5LmJyaWdodG5lc3MoMC4xKSUwQSUwOS5jb250cmFzdCgxLjIpJTBBJTA5Lm1vZHVsYXRlU2NhbGUob3NjKDIpJTJDJTIwLTAuMiklMEElMDkub3V0KCklM0I%3D" width="900" height="400"></iframe>
* Gravitationswellen
** Was?
** Wie wird daraus Musik?
- Werbung: [[https://callitanythingrecords.bandcamp.com/album/ji-k-kan][Ji Kū Kan]]
** let's do techno in 5 minutes!
* Links und Refs
- [[https://tidalcycles.org/][Tidal Cycles]] (Prgrammiersprache Audio - haskell)
- [[https://blog.toplap.org/][TOPLAP]] (the home of live coding - Organisation)
- [[https://algorave.com/][ALGORAVE]] (Organisation)
- [[https://hydra.ojack.xyz/][HYDRA]] (Prgrammiersprache Visuals - js)
- [[https://strudel.cc/][Strudel]] (Programmiersprache Audio - js)
- [[https://sonic-pi.net/][Sonic PI]] (Programmiersprache Audio - ruby)
- [[https://github.com/Qirky/FoxDot][Foxdot]] (Programmiersprache Audio - python)
- [[https://flok.cc][Flok]] (kollaborative Umgebung für Strudel, Hydra, Tidal, etc.)
- [[https://github.com/toplap/awesome-livecoding][viele Links]]
* Kontakt
1. [[https://harte-echtzeit.com/][harte-echtzeit.com]]
2. [[https://sonomu.club/@harte_echtzeit][mastodon]]
3. [[https://github.com/harte-echtzeit][github]]
4. [[https://www.instagram.com/harte_echtzeit/][instagram]]
5. [[https://futur-aaa.com/][futur AAA festival]]

